app/controllers/users_controller.rb

    def index
        @connected = user_signed_in?
        if !@connected
            redirect_to new_user_session_path
        end
        @users = User.all
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]